Table of Contents
Namespace IdeaStatiCa.Plugin
 Classes
ApplicationBIM
AutomationHostingGrpc<MyInterface, ClientInterface>
Grpc Hosting implementation of AutomationHosting<MyInterface, ClientInterface>
AutomationHosting<MyInterface, ClientInterface>
Responsible of hosting an automation service on net.pipe endpoint
AutomationService<ClientInterface>
BIMItemId
BIMItemsGroup
BIMPluginHosting
BIMPluginHostingGrpc
Grpc Implementation of BIMPluginHosting
BIMProject
ConnHiddenClientFactory
ConnReportSettings
Settings of the content of a connection report
ConnectionHiddenCheckClient
Constants
ConversionDictionaryInt
ConversionDictionaryString
ConversionDictionary<TKey>
CrossSectionProjectItem
Identification of an crossection item in the Idea project
ErrorHandlerAttribute
For more details see https://www.c-sharpcorner.com/UploadFile/b182bf/centralize-exception-handling-in-wcf-part-10/
GrpcBimHostingFactory
ISEventArgs
IdeaConnectionController
IdeaStatiCaAppClient
IdeaStatiCaClient<T>
LibraryItem
Identification of an item in IDEA StatiCa MPRL (material and product range library)
MemberHiddenCheckClient
MemberHiddenClientFactory
ModelBIM
ProgressSender
ProjectItem
Identification of an item in the Idea project
ReportResponse
The identifier of the generated report
SerializableDictionary<TKey, TVal>
SerializableDictionary
Tools
WcfErrorHandler
For more details see https://www.c-sharpcorner.com/UploadFile/b182bf/centralize-exception-handling-in-wcf-part-10/
 Interfaces
IApplicationBIM
Abstraction of a FE application which provides data to Idea StatiCa
IAutomation
This interface is used for controlling Idea Statica application from external applictions.
IBIMPluginClient<T>
Responsible for controlling the connected BIM application to IS
IBIMPluginFactory
IBIMPluginHosting
IBimHostingFactory
IClientBIM<B>
IConnCalculatorFactory
IConnHiddenCheck
Provides seamlessly data about connections or allows to run hidden calculation of a connection
IConnectionAutomation
IConnectionController
Automation of IdeaConnection app
IIdeaStaticaApp
IMemberCalculatorFactory
IMemberHiddenCheck
Provides seamlessly data about connections or allows to run hidden calculation of a connection
IProgressCallback
IProgressMessaging
 Enums
AppStatus
AutomationStatus
BIMItemType
LocalisedMessage
MessageSeverity
RequestedItemsType
 Delegates
ISEventHandler